import React from 'react';

const Blog = () => {
    return (
        <div className=' text-center'>
            <h2> What is context API?</h2>
            <p> React  কনটেক্সট এপিআই হল একটি  React  app  এর জন্য  কার্যকরভাবে তৈরি করার একটি উপায় যা চারপাশে পাস করা যেতে পারে। <br /> এটি ‘প্রপ ড্রিলিং বা দাদা-দাদি থেকে শিশু থেকে পিতা মাতার কাছে প্রপস সরানোর বিকল্প। <br />রেডক্স ব্যবহার করে রাজ্য পরিচালনার জন্য প্রসঙ্গটিকে একটি সহজ, হালকা পদ্ধতি হিসাবেও উল্লেখ করা হয়। context api হলো  Reacts 16.3  সংস্করণে যোগ করা একটি (ধরনের নতুন বৈশিষ্ট্য যা একজনকে পুরো অ্যাপ জুড়ে (বা এটির অংশ) হালকাভাবে এবং স্বাচ্ছন্দ্যে স্থিতিভাগ করতে দেয়। </p>
            <h2></h2>
        </div>
    );
};


export default Blog;